using Tyuiu.ShakhovDK.Sprint5.Task5.V9.Lib;
DataService ds = new DataService();
string path = @"C:\DataSprint5\InPutDataFileTask5V9.txt";
double res = ds.LoadFromDataFile(path);
Console.Title = "Спринт #5 | Выполнил: Шахов Д.К | ИИПБ-24-2";
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Спринт #5                                                                              *");
Console.WriteLine("* Тема: Чтение набора данных из текстового файла                                         *");
Console.WriteLine("* Задание #5                                                                             *");
Console.WriteLine("* Вариант #9                                                                             *");
Console.WriteLine("* Выполнил: Шахов Даниил Константинович | ИИПБ-24-2                                      *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                               *");
Console.WriteLine("Дан файл С:\\DataSprint5\\InPutDataFileTask5V9.txt\n" +
    "(файл взять из архива согласно вашему варианту)\n" +
    "Создать папку вручную С:\\DataSprint5\\ и скопировать в неё файл,\n" +
    "в котором есть набор значений.Найти максимальное целое число в файле\n" +
    "Полученный результат вывести на консоль\n" +
    "У вещественных значений округлить до трёх знаков после запятой.");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                       *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine($"Данные находятся в файле: {path}                                                         ");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                             *");
Console.WriteLine(res);
Console.WriteLine("******************************************************************************************");
Console.ReadKey();