using Tyuiu.ShakhovDK.Sprint5.Task6.V29.Lib;
DataService ds = new DataService();
string path = @"C:\DataSprint5\InPutDataFileTask6V29.txt";
int res = ds.LoadFromDataFile(path);
Console.Title = "Спринт #5 | Выполнил: Шахов Д.К | ИИПБ-24-2";
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Спринт #5                                                                              *");
Console.WriteLine("* Тема: Обработка текстовых файлов                                                       *");
Console.WriteLine("* Задание #6                                                                             *");
Console.WriteLine("* Вариант #29                                                                            *");
Console.WriteLine("* Выполнил: Шахов Даниил Константинович | ИИПБ-24-2                                      *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                               *");
Console.WriteLine("Дан файл С:\\DataSprint5\\InPutDataFileTask6V29.txt\n" +
    "(файл взять из архива согласно вашему варианту)\n" +
    "Создать папку вручную С:\\DataSprint5\\ и скопировать в неё файл,\n" +
    "в котором есть набор символьных данных\n" +
    "Найти количество слов длиной семь символов в заданной строке\n                                          ");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                       *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine($"Данные находятся в файле: {path}                                                         ");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                             *");
Console.WriteLine($"Количество слов длиной семь равно: {res}");
Console.WriteLine("******************************************************************************************");
Console.ReadKey();